app/Controllers/CartController.php

    public function create()
    {
        $data = $this->request->getJSON(true);

        // Validasi data masuk
        if (!$data || !isset($data['user_id']) || !isset($data['product_id']) || !isset($data['jumlah'])) {
            return $this->failValidationErrors('user_id, product_id, dan jumlah harus diisi');
        }

        $userId    = $data['user_id'];
        $productId = $data['product_id'];
        $jumlah    = (int) $data['jumlah'];

        $cart = $this->cartModel
            ->where('user_id', $userId)
            ->where('status', 'open')
            ->first();
---
SELECT *
FROM `cart`
WHERE `user_id` = '8'
AND `status` = 'open'
ORDER BY `id_cart` ASC
 LIMIT 1

    public function update($id = null)
    {
        $data = $this->request->getJSON(true);
        $jumlah = (int)($data['jumlah'] ?? 1);
        if ($jumlah < 1) return $this->failValidationErrors('Jumlah minimal 1');

        $this->cartItemModel->update($id, [
            'jumlah'     => $jumlah,
            'updated_at' => date('Y-m-d H:i:s')
        ]);
---
UPDATE `cart_items` SET `jumlah` = 6, `updated_at` = '2025-06-15 06:56:01'
WHERE `cart_items`.`id_item` IN ('60')

    public function getByUser($userId)
    {
        $cart = $this->cartModel
            ->where('user_id', $userId)
            ->where('status', 'open')
            ->first();

        if (!$cart) return $this->respond(['items' => []]);

        $items = $this->cartItemModel
            ->select('cart_items.*, product.nama_produk, product.harga, product.foto, product.stok')
            ->join('product', 'product.id_product = cart_items.product_id')
            ->where('cart_id', $cart['id_cart'])
            ->findAll();
---
SELECT *
FROM `cart`
WHERE `user_id` = '8'
AND `status` = 'open'
 LIMIT 1
SELECT `cart_items`.*, `product`.`nama_produk`, `product`.`harga`, `product`.`foto`, `product`.`stok`
FROM `cart_items`
JOIN `product` ON `product`.`id_product` = `cart_items`.`product_id`
WHERE `cart_id` = '40'