app/Controllers/CategoryController.php

SELECT *
FROM `categories`
---
  public function list()
  {
    $model = new \App\Models\Category();
    $data = $model->findAll();