app/Controllers/Home.php

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_verified` = 1
---
    public function getDashboardStats()
    {
        // Count verified users
        $verifiedUsers = $this->mUsers->where('is_verified', 1)->countAllResults();