app/Controllers/PaymentController.php


    // Hapus keranjang hanya jika bukan pembelian langsung
    if (!$isDirectBuy) {
      $cart = $this->cartModel
        ->where('user_id', $history['user_id'])
        ->where('status', 'open')
        ->first();
      if ($cart) {
        $this->cartItemModel->where('cart_id', $cart['id_cart'])->delete();
        $this->cartModel->update($cart['id_cart'], ['status' => 'closed']);
---
SELECT *
FROM `cart`
WHERE `user_id` = '8'
AND `status` = 'open'
 LIMIT 1
DELETE FROM `cart_items`
WHERE `cart_id` = '38'
UPDATE `cart` SET `status` = 'closed'
WHERE `cart`.`id_cart` IN ('38')

    $customerDetails = $requestData['customer_details'];

    // Ambil data alamat dari tabel users berdasarkan user_id
    $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '8'