app/Controllers/Products.php

    public function getTotalProducts()
    {
        try {
            $total = $this->mProduct->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `product`