app/Models/Product.php

    public function list_all()
    {
        // Setiap fungsi harus mendapatkan instance builder-nya sendiri untuk menghindari konflik.
        return $this->select('product.*, users.nama as nama_user, categories.nama_category')
                    ->join('users', 'users.id = product.user_id', 'left')
                    ->join('categories', 'categories.id_category = product.category_id', 'left')
                    ->orderBy('id_product', 'DESC')
                    ->get()
                    ->getResult();
---
SELECT `product`.*, `users`.`nama` as `nama_user`, `categories`.`nama_category`
FROM `product`
LEFT JOIN `users` ON `users`.`id` = `product`.`user_id`
LEFT JOIN `categories` ON `categories`.`id_category` = `product`.`category_id`
ORDER BY `id_product` DESC