app/Models/Users.php

    public function list_all()
    {
        return $this->findAll();
---
SELECT *
FROM `users`

    public function getuserByid($id)
    {
        return $this->where('id', $id)->first();
---
SELECT *
FROM `users`
WHERE `id` = '11'
 LIMIT 1